In [2]:
import csv  
import pandas as pd

# CSV File Operations : Add Row - Add Column - Show Content File

## 1. Open a CSV File - Create it if it doesn't exist

In [3]:
f = open('test.csv', 'a')

## 2. ADD a Row

In [4]:
fields=['Name','Age']

with open(r'test.csv', 'a') as f:
    writer = csv.writer(f)
    writer.writerow(fields)

In [5]:
# Adding another row to test
fields=['Hassen Amri','23']
with open(r'test.csv', 'a') as f:
    writer = csv.writer(f)
    writer.writerow(fields)

## 3. Add a new Column

In [6]:
df = pd.read_csv("test.csv")
df["moy"] = 0
df.to_csv("test.csv", index=False)

## 4. Show content file

In [7]:
data = pd.read_csv("test.csv")
df = pd.DataFrame(data)
df.head()

          Name  Age  moy
0  Hassen Amri   23    0

### 5. Copy from file to another

In [8]:
# read
data = []
with open('test.csv', 'r') as f:
    f_csv = csv.reader(f)
    # header = next(f_csv)
    for row in f_csv:
        data.append(row)


# write
with open('test2.csv', 'w+') as f:
    writer = csv.writer(f)
    for i in range(len(data)):
        writer.writerow(data[i])

In [9]:
#Show content file
data = pd.read_csv("test2.csv")
df = pd.DataFrame(data)
df.head()

          Name  Age  moy
0  Hassen Amri   23    0

# Removing missing values

### 1. Adding another rows to test removing missing values or NaN values ...

In [24]:
import numpy as np
with open(r'test.csv', 'a') as f:
    writer = csv.writer(f)
    for i in range(5):
        fields=[i, 0, 0]
        writer.writerow(fields)

In [15]:
datacl = pd.read_csv("test.csv")

df = pd.DataFrame(datacl)
df

           Name   Age  moy
0   Hassen Amri  23.0  0.0
1             1   1.0  1.0
2             1   1.0  1.0
3             1   1.0  1.0
4             1   1.0  1.0
5             1   1.0  1.0
6             0   NaN  NaN
7             1   NaN  NaN
8             2   NaN  NaN
9             3   NaN  NaN
10            4   NaN  NaN

### 2. Dropping the rows having missing values

In [16]:
print('DataFrame after dropping the rows having missing values:')
df = df.dropna()
print(df.dropna())

DataFrame after dropping the rows having missing values:
          Name   Age  moy
0  Hassen Amri  23.0  0.0
1            1   1.0  1.0
2            1   1.0  1.0
3            1   1.0  1.0
4            1   1.0  1.0
5            1   1.0  1.0

### 3. Deleting the oldest file

In [17]:
#delete the recent content
import os
file = "test.csv"
if(os.path.exists(file) and os.path.isfile(file)):
    os.remove(file)
    print("file deleted")
else:
    print("file not found")

file deleted

### 4. Exporting the new cleaned Data in a new CSV File

In [18]:
#add new content without missing values
df.to_csv("test.csv", index=False)

In [19]:
#Show content file
data = pd.read_csv("test.csv")
df = pd.DataFrame(data)
df

          Name   Age  moy
0  Hassen Amri  23.0  0.0
1            1   1.0  1.0
2            1   1.0  1.0
3            1   1.0  1.0
4            1   1.0  1.0
5            1   1.0  1.0

### 5. Delete All rows that contains 0 values

In [25]:
#Show content file
data = pd.read_csv("test.csv")
df = pd.DataFrame(data)
df

           Name                        Age                        moy
0   Hassen Amri                       23.0                        0.0
1             1                        1.0                        1.0
2             1                        1.0                        1.0
3             1                        1.0                        1.0
4             1                        1.0                        1.0
5             1                        1.0                        1.0
6             0  <built-in function zeros>  <built-in function zeros>
7             1  <built-in function zeros>  <built-in function zeros>
8             2  <built-in function zeros>  <built-in function zeros>
9             3  <built-in function zeros>  <built-in function zeros>
10            4  <built-in function zeros>  <built-in function zeros>
11            0                          0                          0
12            1                          0                          0
13            2                          0                          0
14            3                          0                          0
15            4                          0                          0

In [47]:
df = df[df.moy != '0']
df

          Name                        Age                        moy
0  Hassen Amri                       23.0                        0.0
1            1                        1.0                        1.0
2            1                        1.0                        1.0
3            1                        1.0                        1.0
4            1                        1.0                        1.0
5            1                        1.0                        1.0
7            1  <built-in function zeros>  <built-in function zeros>